# LightNode Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LightNode Properties
LightNode Class See Also
---
The LightNode type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
| NodeName | A readable name of the output node.  (Inherited from RenderNode.) |

# See Also
LightNode Class
Autodesk.Revit.DB Namespace